Revit 2027 API
ParameterTypeId.RebarShapeEndHookOffset Property
 "End Hook Offset Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeEndHookOffset { get; }
Public Shared ReadOnly Property RebarShapeEndHookOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeEndHookOffset {
	ForgeTypeId^ get ();
}
static member RebarShapeEndHookOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace